closedTank_Antoine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4800;
        startFace       9440;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4800;
        startFace       14240;
    }
    tankWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       19040;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       19160;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       19200;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       19240;
    }
)

// ************************************************************************* //
