closedTank_Antoine/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleInternalEnergy;
}

dpdt no;

// Liquid nitrogen at P = 1 bar

mixture
{
    specie
    {
        molWeight       28.0135;
    }
    equationOfState
    {
        rhoCoeffs<8> ( 1161.58 -4.595 0  0 0 0 0 0);
    }
    thermodynamics
    {
        Hf          0;
        CpCoeffs<8>          (2040.959 0 0 0 0 0 0 0);
        Sf          0;
    }
    transport
    {
        muCoeffs<8>          (1.614e-4 0 0 0 0 0 0 0);
        kappaCoeffs<8>        (0.145 0 0 0 0 0 0 0);
    }
}



// ************************************************************************* //
