closedTank_Antoine/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
    }

    p_rgh
    {
        solver           PBiCGStab;
        preconditioner   DIC;
        tolerance       1e-8;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }

    "(e|h|rho).*"
    {
        // solver          smoothSolver;
        // smoother        symGaussSeidel;
        // tolerance       1e-8;
        // relTol          0.001;
        // minIter         1;
        // maxIter         100;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

    }

    Yi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
        residualAlpha   1e-8;
    }

    "(k|epsilon|omega|Theta).*"
    {
         solver          smoothSolver;
         smoother        symGaussSeidel;
         tolerance       1e-7;
         relTol          0;
         minIter         1;
    }

}

        

PIMPLE
{
    pRefCell            0;
    pRefValue           1e5;
    nOuterCorrectors 2;//3;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors   2;
    faceMomentum        yes;
}

relaxationFactors
{
    fields
    {
        iDmdt           1;
    }

    equations
    {
        ".*"            1;
        "h.*"           1;
    }
}


// ************************************************************************* //
